OpenNuvoton/NUC505BSP/SampleCode/StdDriver/I2S_NAU8822_WAVRECORDER_SD/main.c
    /* I2C as master sends START signal */
    I2C_SET_CONTROL_REG(I2C0, I2C_STA);

    /* Wait I2C Tx Finish */
    while (g_u8EndFlag == 0);
    g_u8EndFlag = 0;
}

void NAU8822_ReadData(char addr)
{
    g_au8TxData[0] = (addr << 1);                   //addr(7bit) + 0 (lsb)

    g_u8DataLen = 0;
    g_u8EndFlag = 0;

    /* I2C as master sends START signal */
    I2C_SET_CONTROL_REG(I2C0, I2C_STA);

    /* Wait I2C Tx Finish */
    while (g_u8EndFlag == 0);
    g_u8EndFlag = 0;
}

void I2C_Delay(int count)
{
    volatile unsigned int i;
    for (i = 0; i < count ; i++);
}

void demo_LineIn()
{
    printf("  NOTE: Need head-phone for external CODEC.\n");
    printf("  NOTE: Need Line-In for external CODEC.\n");

    /* I2C function to write data to slave */
    s_I2C0HandlerFn = (I2C_FUNC)I2C_MasterTx;
    g_u8DeviceAddr = 0x1A;

    NAU8822_WriteData(0, 0x000);   /* Reset all registers */
    I2C_Delay(0x1000);

    //input source is Line-In
    NAU8822_WriteData(1, 0x01F);//R1 MICBIASEN ABIASEN IOBUFEN REFIMP
    NAU8822_WriteData(4, 0x070);//R4 select audio format(I2S format) and word length (32bits)
    NAU8822_WriteData(5, 0x000);//R5 companding ctrl
    NAU8822_WriteData(6, 0x000);//R6 clock ctrl at slave mode
    NAU8822_WriteData(35, 0x000);//R35 disable noise gate
    NAU8822_WriteData(44, 0x044);//R44 Line-In
    NAU8822_WriteData(47, 0x050);//R47 Left ADC boost
    NAU8822_WriteData(48, 0x050);//R48 Right ADC boost
    NAU8822_WriteData(2, 0x1BF);//R2 Power Management 2
    NAU8822_WriteData(3, 0x00F);//R3 Power Management 3
    NAU8822_WriteData(10, 0x000);//R10 DAC control (softmute disable, oversample select 64x (lowest power) )
    NAU8822_WriteData(50, 0x001);//R50 Left mixer
    NAU8822_WriteData(51, 0x001);//R51 Right mixer
    NAU8822_WriteData(49, 0x002);//R49 Output control

    printf("I2C write NAU8822 OK\n");

    s_I2C0HandlerFn = (I2C_FUNC)I2C_MasterRx;

    NAU8822_ReadData(1);//R1 MICBIASEN ABIASEN IOBUFEN REFIMP
    NAU8822_ReadData(4);//R4 select audio format(I2S format) and word length (32bits)
    NAU8822_ReadData(5);//R5 companding ctrl
    NAU8822_ReadData(6);//R6 clock ctrl at slave mode
    NAU8822_ReadData(35);//R35 disable noise gate
    NAU8822_ReadData(44);//R44 Line-In
    NAU8822_ReadData(47);//R47 Left ADC boost
    NAU8822_ReadData(48);//R48 Right ADC boost
    NAU8822_ReadData(2);//R2 Power Management 2
    NAU8822_ReadData(3);//R3 Power Management 3
    NAU8822_ReadData(10);//R10 DAC control (softmute disable, oversample select 64x (lowest power) )
    NAU8822_ReadData(50);//R50 Left mixer
    NAU8822_ReadData(51);//R51 Right mixer
    NAU8822_ReadData(49);//R49 Output control

    printf("I2C read NAU8822 OK at g_u8RxData\n");

    printf("[OK]\n");
}

void demo_MIC(void)
{
    printf("  NOTE: Need head-phone for external CODEC.\n");
    printf("  NOTE: Need 2 mic for external CODEC.\n");

    /* I2C function to write data to slave */
    s_I2C0HandlerFn = (I2C_FUNC)I2C_MasterTx;
    g_u8DeviceAddr = 0x1A;

    NAU8822_WriteData(0, 0x000);   /* Reset all registers */
    I2C_Delay(0x1000);

    //input source is MIC
    NAU8822_WriteData(1, 0x01F);//R1 MICBIASEN ABIASEN IOBUFEN REFIMP
    NAU8822_WriteData(4, 0x070);//R4 select audio format(I2S format) and word length (32bits)
    NAU8822_WriteData(5, 0x000);//R5 companding ctrl
    NAU8822_WriteData(6, 0x000);//R6 clock ctrl at slave mode
    NAU8822_WriteData(35, 0x000);//R35 disable noise gate
    NAU8822_WriteData(45, 0x13F);//R45 Left input PGA gain
    NAU8822_WriteData(46, 0x13F);//R46 Right input PGA gain
    NAU8822_WriteData(44, 0x033);//R44 MIC
    NAU8822_WriteData(47, 0x000);//R47 Left ADC boost
    NAU8822_WriteData(48, 0x000);//R48 Right ADC boost
    NAU8822_WriteData(2, 0x1BF);//R2 Power Management 2
    NAU8822_WriteData(3, 0x00F);//R3 Power Management 3
    NAU8822_WriteData(10, 0x000);//R10 DAC control (softmute disable, oversample select 64x (lowest power) )
    NAU8822_WriteData(45, 0x13F);//R45 Left input PGA gain
    NAU8822_WriteData(46, 0x13F);//R46 Right input PGA gain
    NAU8822_WriteData(50, 0x001);//R50 Left mixer
    NAU8822_WriteData(51, 0x001);//R51 Right mixer
    NAU8822_WriteData(49, 0x002);//R49 Output control

    printf("I2C write NAU8822 OK\n");

    s_I2C0HandlerFn = (I2C_FUNC)I2C_MasterRx;

    NAU8822_ReadData(1);//R1 MICBIASEN ABIASEN IOBUFEN REFIMP
    NAU8822_ReadData(4);//R4 select audio format(I2S format) and word length (32bits)
    NAU8822_ReadData(5);//R5 companding ctrl
    NAU8822_ReadData(6);//R6 clock ctrl at slave mode
    NAU8822_ReadData(35);//R35 disable noise gate
    NAU8822_ReadData(45);//R45 Left input PGA gain
    NAU8822_ReadData(46);//R46 Right input PGA gain
    NAU8822_ReadData(44);//R44 MIC
    NAU8822_ReadData(47);//R47 Left ADC boost
    NAU8822_ReadData(48);//R48 Right ADC boost
    NAU8822_ReadData(2);//R2 Power Management 2
    NAU8822_ReadData(3);//R3 Power Management 3
    NAU8822_ReadData(10);//R10 DAC control (softmute disable, oversample select 64x (lowest power) )
    NAU8822_ReadData(45);//R45 Left input PGA gain
    NAU8822_ReadData(46);//R46 Right input PGA gain
    NAU8822_ReadData(50);//R50 Left mixer
    NAU8822_ReadData(51);//R51 Right mixer
    NAU8822_ReadData(49);//R49 Output control

    printf("I2C read NAU8822 OK at g_u8RxData\n");

    printf("[OK]\n");
}

void SYS_Init(void)
{

    /*---------------------------------------------------------------------------------------------------------*/
    /* Init System Clock                                                                                       */
    /*---------------------------------------------------------------------------------------------------------*/
    /* Unlock protected registers */
    //SYS_UnlockReg();

    /* Enable  XTAL */
    CLK->PWRCTL |= CLK_PWRCTL_HXTEN_Msk;

//    CLK_SetCoreClock(FREQ_96MHZ);
    CLK_SetCoreClock(100000000);

    /* PCLK divider */
    CLK_SetModuleClock(PCLK_MODULE,(uint32_t) NULL, 1);

    /* Lock protected registers */
    //SYS_LockReg();

